### Boolean mask

In [ ]:
import pandas as pd
from dotenv import load_dotenv
import os

# Load environment variables from .env file
load_dotenv()

# Access the PROJECT_PATH variable
project_path = os.getenv("PROJECT_PATH")

# Load data
ex_df = pd.read_csv(os.path.join(project_path, 'ex_df.csv'))

In [ ]:
print(1>0)
print(type(1>0))

True
<class 'bool'>

In [ ]:
#

boolean_mask = ex_df['series_1'] > 2
boolean_mask

0    False
1    False
2     True
3     True
4     True
Name: series_1, dtype: bool

In [ ]:
ex_df[boolean_mask]

   series_1 series_2 series_3
2         3    three      III
3         4     four       IV
4         5     five        V

In [ ]:
ex_df[~boolean_mask]

   series_1 series_2 series_3
0         1      one        I
1         2      two       II